{"loss": "sparse_categorical_crossentropy", "optimizer": {"epsilon": 1e-08, "lr": 0.0010000000474974513, "name": "RMSprop", "rho": 0.8999999761581421}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 512, 4, 4], "trainable": true, "name": "flatten_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 10}}], "sample_weight_mode": null}